mattbrown015/stm32-usb-investigation/usb-device/evk-usb-device-hal.cpp
#include "evk-usb-device-hal.h"

#include <platform/mbed_assert.h>
#include <targets/TARGET_STM/TARGET_STM32F7/STM32Cube_FW/STM32F7xx_HAL_Driver/stm32f7xx_hal.h>

#include <algorithm>
#include <array>
#include <numeric>

namespace evk_usb_device_hal
{

namespace
{

constexpr uint8_t lsb(const uint16_t word);
constexpr uint8_t msb(const uint16_t word);

// 9.1 USB Device States describes the various states.
// I'm hoping we are only interested in a subset of states of the states described in the spec.
enum class device_state_t {
    default_,
    addressed,
    configured
};

// From Table 9-2. Format of Setup Data...
enum class recipient_t: uint8_t {
    device = 0x00,
    interface = 0x01,
    endpoint = 0x02,
    other = 0x03
};

enum class type_t: uint8_t {
    standard = 0x00,
    class_ = 0x20,
    vendor = 0x40
};

enum class direction_t: uint8_t {
    host_to_device = 0x00,
    device_to_host = 0x80
};

enum bmRequestType_masks {
    data_transfer_direction_mask = 0x80,
    type_mask = 0x60,
    recipient_mask = 0x1f
};

// From Table 9-4. Standard Request Codes...
enum class standard_request_codes: uint8_t {
    get_status = 0,
    clear_feature = 1,
    set_feature = 3,
    set_address = 5,
    get_descriptor = 6,
    set_descriptor = 7,
    get_configuration = 8,
    set_configuration = 9,
    get_interface = 10,
    set_interface = 11,
    synch_frame = 12
};

// From Table 9-5. Descriptor Types...
enum class descriptor_t: uint8_t {
    device = 1,
    configuration = 2,
    string = 3,
    interface = 4,
    endpoint = 5,
    device_qualifier = 6,
    other_speed_configuration = 7,
    interface_power = 8
};

// From Table 9-10. Standard Configuration Descriptor...
enum configuration_attributes {
    configuration_attributes_reserved = 0x80,
    configuration_attributes_self_powered = 0x60,
    configuration_attributes_remote_wakeup = 0x40
};

// From Table 9-2. Format of Setup Data...
struct setup_data {
    struct request_type {
        direction_t direction;
        type_t type;
        recipient_t recipient;
    } bmRequestType;
    uint8_t bRequest;
    uint16_t wValue;
    uint16_t wIndex;
    uint16_t wLength;
};

// From 9.2.6.6 Speed Dependent Descriptors...
const uint16_t usb_version_2_0 = 0x0200;

enum string_index {
    langid = 0,
    manufacturer = 1,
    product = 2,
    serial_number = 3
};

const uint8_t ep0_out_ep_addr = 0x00;
const uint8_t ep0_in_ep_addr = 0x80;
const uint8_t ep1_out_ep_addr = 0x01;
const uint8_t ep1_in_ep_addr = 0x81;

const size_t device_descriptor_length = 18;
uint8_t device_descriptor[device_descriptor_length] = {
    // device descriptor, USB spec 9.6.1
    device_descriptor_length,  // bLength
    static_cast<uint8_t>(descriptor_t::device),  // bDescriptorType
    lsb(usb_version_2_0),    // bcdUSB
    msb(usb_version_2_0),
    0x00,                   // bDeviceClass
    0x00,                   // bDeviceSubClass
    0x00,                   // bDeviceprotocol
    USB_OTG_MAX_EP0_SIZE,   // bMaxPacketSize0
    lsb(0x1f00),            // idVendor
    msb(0x1f00),
    lsb(0x2012),            // idProduct
    msb(0x2012),
    lsb(0x0001),            // bcdDevice
    msb(0x0001),
    string_index::manufacturer,  // iManufacturer
    string_index::product,  // iProduct
    string_index::serial_number,  // iSerialNumber
    1                       // bNumConfigurations
};

// From 9.6.7 String...
const size_t langid_string_descriptor_length = 4;
uint8_t langid_string_descriptor[langid_string_descriptor_length] = {
    langid_string_descriptor_length,  // bLength
    static_cast<uint8_t>(descriptor_t::string),  // bDescriptorType
    0x09, 0x04,             // bString Lang ID - 0x0409 - English (United States)
};

const size_t manufacturer_string_descriptor_length = 8;
uint8_t manufacturer_string_descriptor[manufacturer_string_descriptor_length] = {
    manufacturer_string_descriptor_length,  // bLength
    static_cast<uint8_t>(descriptor_t::string),  // bDescriptorType
    'M', 0, 'B', 0, 'r', 0  // bString
};

const size_t product_string_descriptor_length = 8;
uint8_t product_string_descriptor[product_string_descriptor_length] = {
    product_string_descriptor_length,  // bLength
    static_cast<uint8_t>(descriptor_t::string),  // bDescriptorType
    'E', 0, 'V', 0, 'K', 0  // bString
};

const size_t serial_number_string_descriptor_length = 10;
uint8_t serial_number_string_descriptor[serial_number_string_descriptor_length] = {
    serial_number_string_descriptor_length,  // bLength
    static_cast<uint8_t>(descriptor_t::string),  // bDescriptorType
    '0', 0, '0', 0, '0', 0, '1', 0  // bString
};

const uint8_t default_configuration = 1;
const size_t configuration_descriptor_length = 9;
const size_t interface_descriptor_length = 9;
const size_t endpoint_descriptor_length = 7;
const size_t total_configuration_descriptor_length = configuration_descriptor_length + interface_descriptor_length + 2 * endpoint_descriptor_length;
uint8_t configuration_descriptor[total_configuration_descriptor_length] = {
    // configuration descriptor, USB spec 9.6.3
    configuration_descriptor_length,  // bLength
    static_cast<uint8_t>(descriptor_t::configuration),  // bDescriptorType
    lsb(total_configuration_descriptor_length),  // wTotalLength
    msb(total_configuration_descriptor_length),
    1,                      // bNumInterfaces
    default_configuration,  // bConfigurationValue
    0,                      // iConfiguration
    configuration_attributes_reserved,  // bmAttributes
    50,                     // bMaxPower

    // interface descriptor, USB spec 9.6.5
    interface_descriptor_length, // bLength
    static_cast<uint8_t>(descriptor_t::interface),  // bDescriptorType
    0,                      // bInterfaceNumber
    0,                      // bAlternateSetting
    2,                      // bNumEndpoints
    0xff,                   // bInterfaceClass
    0xff,                   // bInterfaceSubClass
    0xff,                   // bInterfaceProtocol
    0,                      // iInterface

    // endpoint descriptor, USB spec 9.6.6
    endpoint_descriptor_length, // bLength
    static_cast<uint8_t>(descriptor_t::endpoint),  // bDescriptorType
    ep1_in_ep_addr,         // bEndpointAddress - EP1 bulk in
    EP_TYPE_BULK,           // bmAttributes
    lsb(USB_OTG_HS_MAX_PACKET_SIZE),  // wMaxPacketSize
    msb(USB_OTG_HS_MAX_PACKET_SIZE),
    1,                      // bInterval

    endpoint_descriptor_length, // bLength
    static_cast<uint8_t>(descriptor_t::endpoint),  // bDescriptorType
    ep1_out_ep_addr,        // bEndpointAddress - EP1 bulk out
    EP_TYPE_BULK,           // bmAttributes
    lsb(USB_OTG_HS_MAX_PACKET_SIZE),  // wMaxPacketSize
    msb(USB_OTG_HS_MAX_PACKET_SIZE),
    1,                      // bInterval
};

PCD_HandleTypeDef hpcd = {
    .Instance = USB_OTG_HS,
    .Init = {
        .dev_endpoints = 9,  // STM32F72x has 1 bidirectional control endpoint0 and 8 HS endpoints configurable to support bulk, interrupt or isochronous transfers
        .Host_channels = 0,  // STM32F72x has 16 HS host channels but setting to 0 as not using host mode
        .speed = PCD_SPEED_HIGH,
        // Disable embedded DMA initially although need to find out how to use DMA.
        // HAL_PCD_Init sets this to DISABLE depending on the value of OTG_CID i.e. it checks if this is a HS device
        .dma_enable = DISABLE,
        .ep0_mps = USB_OTG_MAX_EP0_SIZE,
        .phy_itface = USB_OTG_HS_EMBEDDED_PHY,
        .Sof_enable = DISABLE,
        .low_power_enable = DISABLE,
        .lpm_enable = DISABLE,
        .battery_charging_enable = DISABLE,
        .vbus_sensing_enable = ENABLE,
        .use_dedicated_ep1 = DISABLE,
        .use_external_vbus = DISABLE
    },
    .USB_Address = 0,  // HAL_PCD_Init set this to 0
    // HAL_PCD_Init initialises the IN_ep and OUT_ep upto the number specified in in dev_endpoints.
    .IN_ep = { 0 },
    .OUT_ep = { 0 },
    .Lock = HAL_UNLOCKED,
    .State = HAL_PCD_STATE_RESET,
    .ErrorCode = 0,
    .Setup = { 0 },
    .LPM_State = LPM_L0,
    .BESL = 0,
    .lpm_active = DISABLE,
    .pData = nullptr,
};

device_state_t device_state = device_state_t::default_;

std::array<uint8_t, 10> vendor_request_receive_buffer{ 0x00 };  // usb-host does a /test/ control out request with a payload of
bool vendor_request_receive_buffer_ready = false;

std::array<uint8_t, 64> ep1_transmit_buffer;
std::array<uint8_t, 512> ep1_receive_buffer;

constexpr uint8_t lsb(const uint16_t word) {
    // Not sure that the explicit mask is necessary.
    return word & 0xff;
}

