mattbrown015/stm32-usb-investigation/usb-device/evk-usb-device-hal.cpp
constexpr uint8_t msb(const uint16_t word) {
    return (word & 0xff00) >> 8;
}

setup_data decode_setup_packet(const uint32_t setup[]) {
    const uint8_t bmRequestType = setup[0] & 0xff;
    setup_data setup_data = {
        .bmRequestType = {
            .direction = static_cast<direction_t>(bmRequestType & data_transfer_direction_mask),
            .type = static_cast<type_t>(bmRequestType & type_mask),
            .recipient = static_cast<recipient_t>(bmRequestType & recipient_mask)
        },
        .bRequest = static_cast<uint8_t>((setup[0] & 0xff00) >> 8),
        .wValue = static_cast<uint16_t>((setup[0] & 0xffff0000) >> 16),
        .wIndex = static_cast<uint16_t>(setup[1] & 0x0000ffff),
        .wLength = static_cast<uint16_t>((setup[1] & 0xffff0000) >> 16)
    };
    return setup_data;
}

descriptor_t decode_descriptor_type(const uint16_t wValue) {
    return static_cast<descriptor_t>((wValue & 0xff00) >> 8);
}

uint16_t decode_string_index(const uint16_t wValue) {
    return wValue & 0x00ff;
}

void get_string_descriptor(const uint16_t string_index, uint8_t *&pBuf, uint32_t &len) {
    switch (string_index) {
        case string_index::langid:
            pBuf = &langid_string_descriptor[0];
            len = langid_string_descriptor_length;
            break;
        case string_index::manufacturer:
            pBuf = &manufacturer_string_descriptor[0];
            len = manufacturer_string_descriptor_length;
            break;
        case string_index::product:
            pBuf = &product_string_descriptor[0];
            len = product_string_descriptor_length;
            break;
        case string_index::serial_number:
            pBuf = &serial_number_string_descriptor[0];
            len = serial_number_string_descriptor_length;
            break;
        default:
            MBED_ASSERT(false);
    }
}

void get_descriptor(PCD_HandleTypeDef *const hpcd, const setup_data &setup_data) {
    uint8_t *pBuf = nullptr;
    uint32_t len = 0;

    // I thought I had read in the spec that the request can have zero length in which case
    // there's no point decoding the request because nothing can be returned.
    // Although I haven't seen this happen yet.
    if (setup_data.wLength > 0) {
        const auto descriptor_type = decode_descriptor_type(setup_data.wValue);
        switch(descriptor_type) {
            case descriptor_t::device:
                pBuf = &device_descriptor[0];
                len = device_descriptor_length;
                break;
            case descriptor_t::configuration:
                pBuf = &configuration_descriptor[0];
                len = std::min<uint32_t>(setup_data.wLength, total_configuration_descriptor_length);
                break;
            case descriptor_t::string: {
                get_string_descriptor(decode_string_index(setup_data.wValue), pBuf, len);
                break;
            }
            case descriptor_t::interface:
            case descriptor_t::endpoint:
            case descriptor_t::device_qualifier:
            case descriptor_t::other_speed_configuration:
            case descriptor_t::interface_power:
                MBED_ASSERT(false);
        }
    }

    if (len <= setup_data.wLength) {
        HAL_PCD_EP_Transmit(hpcd, 0x00, pBuf, len);
    } else {
        // I haven't accounted for the request length being shorter than the descriptor because I haven't seen it happen.
        // If/when it does happen it is necessary to implement a mechanism for sending the data in multiple packets.
        MBED_ASSERT(false);
    }
}

void device_get_status(PCD_HandleTypeDef *const hpcd, const uint16_t wLength) {
    // A static buffer is required for the response to a 'Get Status' request.
    // I think the '0x1' indicates 'self-powered' but I'm not sure we are 'self-powered'
    // and I'm not sure this is the correct bit position.
    static uint8_t status[2] = { 0x01, 0x00 };

    // Should solicit USB error response but this will do for now.
    MBED_ASSERT(wLength == 2);
    // Not being in one of these states should really solicit a USB error but the implementation doesn't support this yet.
    MBED_ASSERT(device_state == device_state_t::default_ || device_state == device_state_t::addressed || device_state == device_state_t::configured);

    HAL_PCD_EP_Transmit(hpcd, ep0_out_ep_addr, &status[0], 2);
}

void set_address(PCD_HandleTypeDef *const hpcd, const setup_data &setup_data) {
    MBED_ASSERT(setup_data.wIndex == 0);
    MBED_ASSERT(setup_data.wLength == 0);

    // Should really respond with a USB error but this will do for starters.
    MBED_ASSERT(device_state != device_state_t::configured);

    const uint8_t address = setup_data.wValue;
    MBED_ASSERT(address < 128);

    HAL_PCD_SetAddress(hpcd, address);
    // From 9.2.6.3 Set Address Processing...
    //     In the case of the SetAddress() request, the Status stage successfully completes when the device sends
    //     the zero-length Status packet or when the device sees the ACK in response to the Status stage data packet.
    // Hence send "zero-length Status packet".
    HAL_PCD_EP_Transmit(hpcd, ep0_out_ep_addr, nullptr, 0);

    device_state = address != 0 ? device_state_t::addressed : device_state_t::default_;
}

void set_configuration(PCD_HandleTypeDef *const hpcd, const setup_data &setup_data) {
    const auto configuration = setup_data.wValue;
    if (configuration == default_configuration) {
        // Open the bulk in endpoint and prepare to transmit data when host requests it.
        HAL_PCD_EP_Open(hpcd, ep1_in_ep_addr, USB_OTG_HS_MAX_PACKET_SIZE, EP_TYPE_BULK);
        HAL_PCD_EP_Transmit(hpcd, ep1_in_ep_addr, ep1_transmit_buffer.data(), ep1_transmit_buffer.size());

        // Open the bulk out endpoint and prepare to receive data when the host sends it.
        HAL_PCD_EP_Open(hpcd, ep1_out_ep_addr, USB_OTG_HS_MAX_PACKET_SIZE, EP_TYPE_BULK);
        HAL_PCD_EP_Receive(hpcd, ep1_out_ep_addr, ep1_receive_buffer.data(), ep1_receive_buffer.size());

        // Indicate configuration successfully set...
        HAL_PCD_EP_Transmit(hpcd, ep0_out_ep_addr, nullptr, 0);

        device_state = device_state_t::configured;
    } else if (configuration == 0) {
        HAL_PCD_EP_Transmit(hpcd, ep0_out_ep_addr, nullptr, 0);
        device_state = device_state_t::addressed;
    } else {
        // The configuration can be 0 in which case the device should enter the 'Address state'.
        // See 9.4.7 Set Configuration.
        // But, I haven't seen this happen.
        MBED_ASSERT(false);
    }
}

void standard_device_request(PCD_HandleTypeDef *const hpcd, const setup_data &setup_data) {
    switch (static_cast<standard_request_codes>(setup_data.bRequest)) {
        case standard_request_codes::get_status:
            device_get_status(hpcd, setup_data.wLength);
            break;
        case standard_request_codes::set_address:
            set_address(hpcd, setup_data);
            break;
        case standard_request_codes::get_descriptor:
            get_descriptor(hpcd, setup_data);
            break;
        case standard_request_codes::set_configuration:
            set_configuration(hpcd, setup_data);
            break;
        case standard_request_codes::clear_feature:
        case standard_request_codes::set_feature:
        case standard_request_codes::set_descriptor:
        case standard_request_codes::get_configuration:
        case standard_request_codes::get_interface:
        case standard_request_codes::set_interface:
        case standard_request_codes::synch_frame:
            MBED_ASSERT(false);
    }
}

void vendor_device_request(PCD_HandleTypeDef *const hpcd, const setup_data &setup_data) {
    switch (setup_data.bRequest) {
        case 0:
            if (setup_data.bmRequestType.direction == direction_t::host_to_device) {
                vendor_request_receive_buffer.fill(0);

                const auto len = std::min<uint32_t>(setup_data.wLength, vendor_request_receive_buffer.size());
                HAL_PCD_EP_Receive(hpcd, ep0_in_ep_addr, vendor_request_receive_buffer.data(), len);
                HAL_PCD_EP_Transmit(hpcd, ep0_out_ep_addr, nullptr, 0);

                vendor_request_receive_buffer_ready = true;
            } else {
                static std::array<uint8_t, 13> send_request_data{ "send request" };
                const auto len = std::min<uint32_t>(setup_data.wLength, send_request_data.size());
                HAL_PCD_EP_Transmit(hpcd, ep0_out_ep_addr, send_request_data.data(), len);
            }
            break;
        default:
            MBED_ASSERT(false);
    }
}

void device_request(PCD_HandleTypeDef *const hpcd, const setup_data &setup_data) {
    const auto bmRequestType = setup_data.bmRequestType;
    switch (bmRequestType.type) {
        case type_t::standard:
            standard_device_request(hpcd, setup_data);
            break;
        case type_t::class_:
            MBED_ASSERT(false);
        case type_t::vendor:
            vendor_device_request(hpcd, setup_data);
            break;
    }
}

void setup_stage_callback(PCD_HandleTypeDef *const hpcd) {
    const auto setup_data = decode_setup_packet(hpcd->Setup);
    const auto bmRequestType = setup_data.bmRequestType;

    switch (bmRequestType.recipient) {
        case recipient_t::device:
            device_request(hpcd, setup_data);
            break;
        case recipient_t::interface:
        case recipient_t::endpoint:
        case recipient_t::other:
            MBED_ASSERT(false);
    }
}

